package eddie.wu.manual;

import java.util.ArrayList;
import java.util.List;

import junit.framework.TestCase;

import org.apache.log4j.Level;
import org.apache.log4j.Logger;

import eddie.wu.domain.Block;
import eddie.wu.domain.Constant;

/**
 * <br/>
 * <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋001.SGF 共293手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋002.SGF 共235手 黑胜3目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋003.SGF 共209手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋004.SGF 共193手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋005.SGF 共251手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋006.SGF 共250手 白胜8目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋007.SGF 共271手 黑胜4目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋008.SGF 共163手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋009.SGF 共189手 白胜4目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋010.SGF 共246手 黑胜6目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋011.SGF 共266手 黑胜6目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋012.SGF 共266手 黑胜8目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋013.SGF 共141手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋014.SGF 共184手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋015.SGF 共257手 黑胜3目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋016.SGF 共216手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋017.SGF 共124手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋018.SGF 共223手 白胜8目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋019.SGF 共258手 黑胜2目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋020.SGF 共217手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋021.SGF 共174手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋022.SGF 共259手 白胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋023.SGF 共284手 黑胜半目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋024.SGF 共185手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋025.SGF 共229手 白胜6目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋026.SGF 共271手 白胜8目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋027.SGF 共187手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋028.SGF 共272手 白胜1目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋029.SGF 共203手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋030.SGF 共332手 黑胜5目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋031.SGF 共232手 黑胜1目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋032.SGF 共195手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋033.SGF 共193手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋034.SGF 共203手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋035.SGF 共300手 白胜3目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋036.SGF 共185手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋037.SGF W+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋038.SGF B+5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋039.SGF B+5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋040.SGF B+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋041.SGF W+R <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋042.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋043.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋044.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋045.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋046.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋047.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋048.SGF B+6 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋049.SGF B+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋050.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋051.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋052.SGF B+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋053.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋054.SGF W+3.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋055.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋056.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋057.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋058.SGF W+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋059.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋060.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋061.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋062.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋063.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋064.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋065.SGF 共210手 黑胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋066.SGF 共277手 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋067.SGF 共241手 黑胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋068.SGF W+5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋069.SGF W+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋070.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋071.SGF W+8 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋072.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋073.SGF B+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋074.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋075.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋076.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋077.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋078.SGF 共278手 白胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋079.SGF 共211手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋080.SGF 共258手 白胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋081.SGF 白胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋082.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋083.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋084.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋085.SGF W+8 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋086.SGF B+12 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋087.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋088.SGF W+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋089.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋090.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋091.SGF 共277手 白胜5目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋092.SGF 共203手 黑胜4目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋093.SGF 共250手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋094.SGF W+5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋095.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋096.SGF B+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋097.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋098.SGF W+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋099.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋100.SGF W+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋101.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋102.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋103.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋104.SGF W+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋105.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋106.SGF W+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋107.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋108.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋109.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋110.SGF W+6 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋111.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋112.SGF W+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋113.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋114.SGF W+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋115.SGF W+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋116.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋117.SGF B+0.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋118.SGF W+4.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋119.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋120.SGF W+7 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋121.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋122.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋123.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋124.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋125.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋126.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋127.SGF B+8 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋128.SGF W+8 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋129.SGF B+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋130.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋131.SGF B+5.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋132.SGF W+2.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋133.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋134.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋135.SGF W+6 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋136.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋137.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋138.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋139.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋140.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋141.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋142.SGF W+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋143.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋144.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋145.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋146.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋147.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋148.SGF W+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋149.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋150.SGF W+7 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋151.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋152.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋153.SGF 共264手 黑胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋154.SGF 共247手 黑胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋155.SGF 共140手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋156.SGF W+6 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋157.SGF W+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋158.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋159.SGF B+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋160.SGF W+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋161.SGF B+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋162.SGF W+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋163.SGF 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋164.SGF B+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋165.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋166.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋167.SGF W+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋168.SGF B+2 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋169.SGF B+10 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋170.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋171.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋172.SGF B+7 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋173.SGF 共285手 和棋 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋174.SGF 共153手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋175.SGF 共237手 白胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋176.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋177.SGF B+6 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋178.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋179.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋180.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋181.SGF B+4 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋182.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋183.SGF 共163手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋184.SGF 共184手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋185.SGF 共262手 白胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋186.SGF 共246手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋187.SGF 共274手 白胜5目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋188.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋189.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋190.SGF W+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋191.SGF 共184手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋192.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋193.SGF 白4目胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋194.SGF 白3目胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋195.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋196.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋197.SGF 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋198.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋199.SGF 白5目胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋200.SGF 黑3目胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋201.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋202.SGF 共198手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋203.SGF W+2.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋204.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋205.SGF B+0.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋206.SGF B+3 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋207.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋208.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋209.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋210.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋211.SGF B+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋212.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋213.SGF 共267手 白胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋214.SGF 共237手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋215.SGF B+1 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋216.SGF 黑胜12目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋217.SGF 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋218.SGF 白2目胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋219.SGF 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋220.SGF 共239手 黑胜5目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋221.SGF 共258手 黑胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋222.SGF 共198手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋223.SGF 共257手 黑胜3目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋224.SGF 共279手 黑胜8目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋225.SGF 共260手 白胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋226.SGF 共257手 黑胜4目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋227.SGF 共124手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋228.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋229.SGF 共189手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋230.SGF 共244手 白胜3目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋231.SGF 共149手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋232.SGF 共218手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋233.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋234.SGF W+3.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋235.SGF W+1.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋236.SGF 共198手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋237.SGF 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋238.SGF 共150手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋239.SGF 共153手 以下不明 白胜1目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋240.SGF 共208手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋241.SGF 共275手 白胜1目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋242.SGF 共201手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋243.SGF 共240手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋244.SGF 共214手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋245.SGF 共141手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋246.SGF 共261手 黑中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋247.SGF 共301手 黑胜1目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋248.SGF 共278手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋249.SGF W+1.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋250.SGF B+0.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋251.SGF B+7.5 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋252.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋253.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋254.SGF W+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋255.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋256.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋257.SGF B+Resign <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋258.SGF 共294手 白胜11目半 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋259.SGF 共186手 白中盘胜 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋260.SGF 共250手 黑胜半目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋261.SGF 共249手 白胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋262.SGF 共282手 黑胜2目 <br/>
 * doc/围棋打谱软件/吴清源番棋263局/吴清源番棋263.SGF 共165手 黑中盘胜
 */
public class TestSGFGoManual extends TestCase {
	private static Logger log = Logger.getLogger(Block.class);
	static{
		log.setLevel(Level.INFO);
	}
	public void test_(int index) {
		String fileName = SGFGoManual.getFileName(index);
		SimpleGoManual manual = SGFGoManual.loadSimpleGoManual(fileName);
		if(log.isEnabledFor(Level.WARN)) log.warn(manual);
		ConvertGoManual convert = new ConvertGoManual();
		convert.convertFormat(manual);
		fileName += ".bak";
		SGFGoManual.storeGoManual(fileName, manual);

		int lastStep = 0;
		for (StepSymmetry sym : manual.getStepSymmetry()) {
			if(log.isEnabledFor(Level.WARN)) log.warn("After step " + sym.getStepIndex() + " is "
					+ sym.getSymmetry());
			lastStep = sym.getStepIndex();
		}
		for (int i = 1; i <= lastStep; i++) {
			if(log.isEnabledFor(Level.WARN)) log.warn(manual.getStep(i-1));
		}
	}

	public void test() {
		test_(1);
		test_(10);
		test_(100);
	}

	/**
	 * 21s<br/>
	 * maxStepSym = 9, at go manual 9<br/>
	 * maxSym = 12, at go manual9<br/>
	 * maxLastStep = 24, at go manual 202<br/>
	 */
	public void testStatistics() {
		Constant.INTERNAL_CHECK = false;
		List<SymmetryStatistic> stats = new ArrayList<SymmetryStatistic>();
		for (int i = 1; i <= 263; i++) {
			String fileName = SGFGoManual.getFileName(i);
			SimpleGoManual manual = SGFGoManual.loadSimpleGoManual(fileName);
			SymmetryStatistic stat = manual.getSymStatistics(i);
			stats.add(stat);
		}
		SymmetryStatistic.statistic(stats);
	}

}
